In [11]:
import pandas as pd

In [13]:
a=['Man City','Arsenal','Liverpool']
b=[1880,1886,1892]
c=['The Cityzens','The Gunners','YNWA']
pd.DataFrame([a,b,c])

              0            1          2
0      Man City      Arsenal  Liverpool
1          1880         1886       1892
2  The Cityzens  The Gunners       YNWA

In [32]:
pd.DataFrame({'Team':a,'Founded':b,'Nickname':c})

        Team  Founded      Nickname
0   Man City     1880  The Cityzens
1    Arsenal     1886   The Gunners
2  Liverpool     1892          YNWA

In [15]:
df=pd.DataFrame({'Team':a,'Founded':b,'Nickname':c})

In [16]:
df.head()

        Team  Founded      Nickname
0   Man City     1880  The Cityzens
1    Arsenal     1886   The Gunners
2  Liverpool     1892          YNWA

In [18]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [25]:
df["Team"]

0     Man City
1      Arsenal
2    Liverpool
Name: Team, dtype: object

In [28]:
df.iloc[0]

Team            Man City
Founded             1880
Nickname    The Cityzens
Name: 0, dtype: object

In [47]:
df2=pd.DataFrame({"Team":pd.Categorical(["Man City","Arsenal","Liverpool"]),
                  "Founded":(1880,1886,1892),
                  "Nickname":pd.Categorical(["The Cityzens","The Gunners","YNWA"])
                                         }
                )

In [48]:
df2

        Team  Founded      Nickname
0   Man City     1880  The Cityzens
1    Arsenal     1886   The Gunners
2  Liverpool     1892          YNWA

In [46]:
df.to_csv('Asamoah_pandasChallenge.csv', index=False)

1. The write/render/evaluate loop provides creators with the opportunity to experiment with their designs, mappings and setting of rules over and over to view different outpust and filter the best choice.
2. Processing visual information is done much faster compared to numerical data, most humans(myself included) tend to to detect patterns, trends, and relationships when presented visually, interactive charts also tend to build a story and most humans(again, including myself) better understand narratives when they are supported visually making dynamic, interactive data visualizations particularly effective for communication.
3. Yes i agree with Murray's claim because open-source tools allow users from different backgrounds around the world to access, create and produce outputs without paying for expensive licenses, open source tools also foster a big,strong community where other users can support, improve, review and reference projects which could further refine one's skills.